#---------------------------------Задача 1------------------------------------------
#даны 3 числа, распечатать в порядке возрастания

digits = [int(input("1st: ")), int(input("2nd: ")), int(input("3rd: "))]

digits.sort()
print(digits)

#---------------------------------Задача 2------------------------------------------

# Написать программу для следующей задачи
# работают 3 сотрудника, у них есть оклад в размере 300.
# Если сотрудник выполнит 50 и более продаж, то получит премию в размере 30% от оклада,
# если более 75, то получит премию в размере 65% от оклада,
# а если 100, то - 100% от оклада










